from rich.console import Console
from rich.panel import Panel

console = Console()


def show_banner():
    banner = """
 █████╗ ███████╗███████╗      ██████╗  ██████╗███╗   ███╗
██╔══██╗██╔════╝██╔════╝     ██╔════╝ ██╔════╝████╗ ████║
███████║█████╗  ███████╗     ██║  ███╗██║     ██╔████╔██║
██╔══██║██╔══╝  ╚════██║     ██║   ██║██║     ██║╚██╔╝██║
██║  ██║███████╗███████║     ╚██████╔╝╚██████╗██║ ╚═╝ ██║
╚═╝  ╚═╝╚══════╝╚══════╝      ╚═════╝  ╚═════╝╚═╝     ╚═╝
"""
    console.print(
        Panel.fit(
            banner,
            title="AES-GCM Image Cipher CLI",
            border_style="cyan",
        )
    )


def print_success(message: str):
    console.print(f"[bold green]✔ {message}[/]")


def print_error(message: str):
    console.print(f"[bold red]✖ {message}[/]")


def print_info(message: str):
    console.print(f"[bold cyan]ℹ {message}[/]")


def print_warning(message: str):
    console.print(f"[bold yellow]⚠ {message}[/]")
